{
  "Releases": {
    "1.0.5.0": {
      "Date": "13/04/2019",
      "Changes": [
        {
          "Type": "Fixed",
          "Date": "13/04/2019",
          "Summary": "Crash when adding cloud vault",
          "Description": "Fixed crash from occurring when adding several cloud vaults in succession on Android.",
          "Platform": "Android"
        },
        {
          "Type": "Changed",
          "Date": "13/04/2019",
          "Summary": "App Reset",
          "Description": "Application reset now just renames the 4 configuration files, if they exist.  No files are deleted.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Changed",
          "Date": "13/04/2019",
          "Summary": "Startup flow re-structure.",
          "Description": "The startup flow has been restructured so that the landing page 'tap to begin' is displayed before any substantial code is processed. Tapping to begin will start the application code.  This is to help against any potential startup issues, and as such a button has been added to the bottom of the landing page to help diagnose/fix startup issues.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Changed",
          "Date": "12/04/2019",
          "Summary": "Vault synchronisation only works on 'My Vaults' page.",
          "Description": "Vault synchronisation will now occur on any page, starting with 'My Vaults' page.  The currently opened vault won't be synchronised, and now there's a new sync indicator at the top right of the 'My Vaults' page.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Fixed",
          "Date": "11/04/2019",
          "Summary": "Intermittent crash after adding / removing vault.",
          "Description": "Fixed issue where if a vault was added / removed whilst synchronisation was taking place, cachy would crash due to the vault index collection changing.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Added",
          "Date": "08/04/2019",
          "Summary": "Vault / credential context menu message.",
          "Description": "Added a small message at the bottome of the vault / credential lists that inform the user of the context menu on vaults and credentials.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Changed",
          "Date": "08/04/2019",
          "Summary": "Cloud provider connecting message.",
          "Description": "When an OAuth cloud provider is selected, due to the delay while the process is started, a 'connecting' message is displayed to prevent the user clicking on other stuff and thinking the app has crashed.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Changed",
          "Date": "08/04/2019",
          "Summary": "Added supported cloud providers to cloud sync mode description.",
          "Description": "Added the currently supported cloud provider names to the sync mode page in the first run wizard, so the user can see without first pressing 'cloud'.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Changed",
          "Date": "08/04/2019",
          "Summary": "Added swipe direction text to first run wizard.",
          "Description": "The 'first run wizard' said 'swipe to begin' etc, it now says 'swipe left' everywhere that it says to swipe.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Removed",
          "Date": "08/04/2019",
          "Summary": "Website field removed from quick access panel.",
          "Description": "The website field in the credential quick access panel was mapping to the password field.  But as you can browse to the website directly via the credential context menu anyway, this field is not-required within the quick access panel so has been removed.",
          "Platform": "UWP, Android"
        }
      ]
    },
    "1.0.4.0": {
      "Date": "07/04/2019",
      "Changes": [
        {
          "Type": "Added",
          "Date": "06/04/2019",
          "Summary": "First run wizard.",
          "Description": "Created a wizard to guide the new user through the setup of cachy and optional creation of their first vault.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Added",
          "Date": "05/04/2019",
          "Summary": "Modular JSON serialisation.",
          "Description": "The underlying data serialisation classes have been made modular in order to help future changes to the format whilst reducing the risk of breaking changes.  The version used to write the JSON is first used to read, then the latest version is used to write, silently upgrading JSON format.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Fixed",
          "Date": "05/04/2019",
          "Summary": "Removing storage provider that's in use, causes startup crash.",
          "Description": "When a storage provider that's in use is removed, the associated vault is also removed.  The user is notified first.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Added",
          "Date": "05/04/2019",
          "Summary": "Password Age.",
          "Description": "Password age can now be optionally show on the credentials within the vault view. This shows the number of days since the password was last changed.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Added",
          "Date": "05/04/2019",
          "Summary": "Credential Sorting.",
          "Description": "Credentials can now be sorted by a selection of fields and ascending / descending.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Added",
          "Date": "04/04/2019",
          "Summary": "Amazon S3 Support.",
          "Description": "You can now synchronise your cachy vault with an Amazon S3 bucket.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Changed",
          "Date": "03/04/2019",
          "Summary": "Some settings tabs unusable on small screens.",
          "Description": "All tabs except the sync tab now include scrollviews to stop the controls becoming squashed up and unusable on small displays.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Added",
          "Date": "03/04/2019",
          "Summary": "Browse to website.",
          "Description": "You can now open the website associated with a credential in the device default browser by holding/right clicking on the credential and selecting 'Browse to website...'. There is also a new setting for this that will automatically prefix a protocol of your choosing to the website url, this means you can enter just 'www.somewebsite.com' and still browse to it.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Changed",
          "Date": "02/04/2019",
          "Summary": "Improved search",
          "Description": "Search now supports tags, by prefixing with the '#' symbol. Separate search terms by a space.",
          "Platform": "UWP, Android"
        },
        {
          "Type": "Added",
          "Date": "02/04/2019",
          "Summary": "Credential tags.",
          "Description": "Tags can now be added to each credential.",
          "Platform": "UWP, Android"
        }
      ]
    },
    "1.0.3.0": {
      "Date": "31/03/2019",
      "Changes": [
        {
          "Type": "Fixed",
          "Date": "31/03/2019",
          "Summary": "Clipboard obfuscator still runs even though cachy has been closed.",
          "Description": "Clipboard obfuscator is now stopped when the app window loses focus, and restarted when it gets focus.",
          "Platform": "Android"
        },
        {
          "Type": "Changed",
          "Date": "31/03/2019",
          "Summary": "Burger menu expand transition changed.",
          "Description": "Burger menu now has a slight bounce when opened / closed now, and also the logo are is faded in / out.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Changed",
          "Date": "31/03/2019",
          "Summary": "Audit entry item text is truncated oddly.",
          "Description": "Changed style of audit lists to be more similar to change logging, so now all text is visible for each item.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Added",
          "Date": "31/03/2019",
          "Summary": "Additional tokens for new vault filename auto-generation.",
          "Description": "2 new tokens have been added for the vault filename generation, these are {Name} (Name of the vault) and {ddMMyyyy} the current date; formatted.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Changed",
          "Date": "31/03/2019",
          "Summary": "Cloud providers in 'Create Vault' page are not on screen in lower resolutions.",
          "Description": "Changed the 'no cloud providers' panel, and all similar panels to have a smaller font and icon, plus changed the sync mode descriptions to be more concise.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Changed",
          "Date": "31/03/2019",
          "Summary": "Wording issue on 'My Vaults' page when no vaults are found.",
          "Description": "Changed 'yet' to 'here' in order to be explicit about the device the user is on.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Fixed",
          "Date": "31/03/2019",
          "Summary": "Vault page shown before vault is fully unlocked.",
          "Description": "Fixed issue where the vault page is flipped to, even when the passphrase is incorrect.  The vault unlock is now attempted in the vault list page before proceeding.  Also disabled accept button on unlock page until a passphrase is entered.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Added",
          "Date": "30/03/2019",
          "Summary": "Auto-save functionality.",
          "Description": "Added auto-save functionality that can be enabled to requirement. This makes it more convenient when adding new credentials and using straight away, without having to first lock your valut to save it.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Fixed",
          "Date": "30/03/2019",
          "Summary": "Entering invalid data into numerical settings fields crashes the app.",
          "Description": "Erroneous input is now handled on all textboxes requiring an integer value to be entered within the settings page.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Changed",
          "Date": "30/03/2019",
          "Summary": "Change log items turn blue when clicked.",
          "Description": "Removed selection ability from change log list, as it's not needed.  Mouse-over is still turning them grey, will address this at a later date.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Changed",
          "Date": "30/03/2019",
          "Summary": "Cannot reveal confirmation password of credential editor.",
          "Description": "Password reveal button for password entry, now operates confirmation password entry as well as its own state.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Fixed",
          "Date": "30/03/2019",
          "Summary": "Password entry views remember their reveal state.",
          "Description": "Password entry views reveal state is now reset as expected.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Changed",
          "Date": "24/03/2019",
          "Summary": "Switching between about and settings fills the navigation history.",
          "Description": "Changed navigation so that if the current item is common, as is the last, the last common item is removed from the history stack.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Changed",
          "Date": "24/03/2019",
          "Summary": "OAuth web browser page has large margin at the bottom.",
          "Description": "The bottom margin has been removed and code has been put in place to supposedly adjust the window when the Android keyboard is visible (flakey).",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Changed",
          "Date": "24/03/2019",
          "Summary": "Cloud provider configuration appears crashed when selecting a provider.",
          "Description": "The 'connecting' message is now displayed the second you select a provider to prevent it looking like the app has crashed.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Removed",
          "Date": "24/03/2019",
          "Summary": "Drop shadows on burger menu look odd, especially on Android.",
          "Description": "Some of the frames within the burger menu had shadows enabled erroneously, these have been removed.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Fixed",
          "Date": "24/03/2019",
          "Summary": "Edge of password reveal glyph slightly truncated.",
          "Description": "Slight modifications to the glyph button control so that the entire glyph is visible.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Changed",
          "Date": "24/03/2019",
          "Summary": "Burger menu common items stay enabled even when on the page.",
          "Description": "The common items are now enabled / disabled depending on what page you're on. This prevents the user from selecting the same item multiple times and causing confusion whilst navigating back again.",
          "Platform": "UWP,Android"
        }
      ]
    },
    "1.0.2.0": {
      "Date": "23/03/2019",
      "Changes": [
        {
          "Type": "Changed",
          "Date": "23/03/2019",
          "Summary": "Password entry fields require a 'show/reveal' option.",
          "Description": "A new control was created to replace the existing password entry control.  This one has the option to reveal the password behind the asterisks.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Added",
          "Date": "23/03/2019",
          "Summary": "Crerdentials cannot be duplicated.",
          "Description": "Added option to duplicate existing credentials that can then be edited.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Added",
          "Date": "22/03/2019",
          "Summary": "Clipboard Obfuscator.",
          "Description": "Added new advanced setting for Clipboard Obfuscator. This feature will help protect against malware monitoring clipboard activity.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Added",
          "Date": "17/03/2019",
          "Summary": "Test change for UI testing.",
          "Description": "This is a test change item to simply test what it looks like in the UI.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Changed",
          "Date": "17/03/2019",
          "Summary": "Test change for UI testing.",
          "Description": "This is a test change item to simply test what it looks like in the UI.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Fixed",
          "Date": "17/03/2019",
          "Summary": "Test change for UI testing.",
          "Description": "This is a test change item to simply test what it looks like in the UI.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Removed",
          "Date": "17/03/2019",
          "Summary": "Test change for UI testing.",
          "Description": "This is a test change item to simply test what it looks like in the UI.",
          "Platform": "UWP,Android"
        },
        {
          "Type": "Added",
          "Date": "17/03/2019",
          "Summary": "Change logging.",
          "Description": "Added changing logging to cachy to keep users informed of all app updates, this can be accessed through the 'About' page.",
          "Platform": "UWP,Android"
        }
      ]
    }
  }
}